<h3>Программный комплекс <strong>&quot;LasGIS&quot;</strong></h3>
<p>Программный комплекс LasGIS существует с 1992 года как информационно-поисковая
система городского хозяйства, как основа муниципальной ГИС.</p>
<table>
  <tr><td valign='top'>
<p>В данный момент с комплексом работают различные геодезические (и не только)
организации города Омска:</p>
<ul>
  <li>ТИСИЗ</li>
  <li>152 экспедиция</li>
  <li>Главомскархитектура</li>
  <li>Аграрный Университет и т.д.</li>
  <li>Департамент Недвижимости</li>
  <li>Городской Земельный комитет</li>
</ul>
<p>Комплекс предназнач для работы с глобальным банком кадастровой информации в
режиме распределенного доступа. Банк кадастровой информации состоит из трех частей:</p>
<ul>
  <li>Растровая карта</li>
  <li>Векторная карта</li>
  <li>Семантическая база</li>
</ul>
  </td><td valign='top'><img alt="LasGIS_View" src="../images/LasGIS_View.jpg" height='300px' width='300px' title='Примерный вид главной программы LasGIS_View'/></td></tr>
</table>
<h4><a name='consists_of'>Состав ПК LasGIS</a></h4>
<p>В состав программного комплекса LasGIS входят следующие части:</p>

<h5><a name='Geo_exe'><strong>Geo.exe</strong> (LasGIS под DOS)</a></h5>

<p>Основная программа для работы в среде MS DOS имеет следующие возможности:</p>
<ol style="list-style-type: arabic-numbers" >
  <li value="1">редактирование графических объектов:
    <ol style="list-style-type: lower-alpha" >
      <li>мышкой (по растровой карте),</li>
      <li>с помощью дигитайзера,</li>
      <li>через занесение координат точек вручную;</li>
    </ol>
  <li>Создание и отладка программ на встроенном языке описания задач;</li>
  <li>работа с атрибутивной базой данных (получение справки по объекту, поиск графического объекта по атрибутам);</li>
  <li>возможность конвертировать графические и семантические данные в другие системы;</li>
  <li>настройка тематических слоев карты;</li>
  <li>настройка вида изображения;</li>
  <li>настройка семантических баз данных;</li>
  <li>настройка номенклатуры планшетов</li>
  <li>имеется защита от несанкционированного доступа (система паролей и журнал регистрации действий пользователей)</li>
  <li>печать карт на известных принтерах;</li>
  <li>имеется интерактивная подсказка по всем функциям и режимам системы.</li>
</ol>
<p>Для ознакомления с программой <strong>Geo.exe</strong> можно воспользоваться
демонстрационным роликом.</p>
<p><a href='../download/DEMOROL.zip'>Скачать деморолик DEMOROL.zip (1.2 Mb)</a><p>
<p>После скачивания, архив надо развернуть в отдельном каталоге и запустить
файл <span class='Refer'>play.bat</span>.</p>
<p>Более подробно про работу с роликом можно посмотреть в файле
DEMOROL.TXT, находящемся внутри архива.<p>

<h5><a name='LasGIS_exe'><strong>LasGIS.exe</strong> (LasGIS под Windows)</a></h5>

<p>Основная программа для работы с картой в среде Windows 95/NT/2000/XP.
Имеет следующие возможности:</p>
<ol style="list-style-type: arabic-numbers" >
  <li>печать высококачественных карт на любых принтерах любого формата с неограниченным числом страниц;</li>
  <li>редактирование графических объектов;</li>
  <li>получение справки по объектам (из атрибутивной базы).</li>
  <li>Составление запросов с поиском по атрибутивной базе данных.</li>
</ol>

<h5><a name='PCXBreak_exe'><strong>PCXBreak.exe</strong> (MS DOS)</a></h5>
<p>Предназначена для создания бесконечнах растровых карт системы LasGIS.</p>
<p>Преобразует входные файлы .PCX в файлы растровой карты с возможностью
 ограничения трансформируемой области.</p>

<h5><a name='MakeRastr_exe'><strong>MakeRastr.exe</strong> (Windows)</a></h5>
<p>Как и PCXBreak.exe предназначена для создания бесконечнах растровых карт, но имеет следующие отличия:</p>
<ol style="list-style-type: arabic-numbers" >
  <li>добавлена поддержка форматов .PCX и .BMP.</li>
  <li>работает значительно быстрее за счет эффективного использования памяти и работы в 32-разрядном режиме.</li>
  <li>добавлена функция очистки исходного растрового изображения.</li>
</ol>
