[
  1, true, "Container.html", "Внутренний формат файла-контейнера.",
  2, true, "Container.html", "Формат файла - контейнера.",
  3, true, "API_Container.html", "API доступа к данным Контейнера",
  3, true, "Global_CFG.html", "Конфигурация предприятия",
  3, true, "Main_CFG.html", "ФАЙЛ главной конфигурации проекта",
  3, true, "User_CFG.html", "Пользовательская конфигурация проекта",
  3, true, "Objects_File.html", "Тематический слой графических объектов карты",
  2, true, "Container_Old.html", "Старый формат файла - контейнера.",
  3, true, "Main_CFG_Old.html", "Главная конфигурация проекта (старый формат)",
  3, true, "User_CFG_Old.html", "Пользовательская конфигурация проекта (старый формат)",
  3, true, "Objects_File_Old.html", "Тематический слой графических объектов карты (старый формат)",
  3, true, "../Rules/EditMapo.html", "Правила редактирования графических объектов карты"
]