<p><font SIZE="4"><strong><sup><a NAME="_Toc448816876"></a></sup>2.Формат
графического объекта хранимого в базе</strong></font></p>

<p>Для формата графического объекта хранимого в
базе необходимо обеспечить целостность объекта
и преемственность при изменении формата.</p>

<p>Целостность объекта подразумевает хранение
объекта как единый и неразрывный блок данных. Это
позволит при организации технологии
клиент-сервер пересылать по сети карту
отдельными объектами.</p>

<p>Преемственность объекта подразумевает
сохранение в теле объекта типа объекта
(плоскость, линия или точка) и версию типа
объекта. Это позволит хранить в базе объекты
разных версий, а при конвертации в работающий
объект учитывать версию объекта. При конвертации
работающего объекта в хранимый, сохранять объект
желательно в последнем, утвержденном формате.</p>
