<h1>Старый формат файла - контейнера.</h1>

<p>Cуществующие типы файлов - контейнеров имеют
свои не согласованные форматы. Но в общем случае
они представляет собой набор индексированных
блоков, содержание ккоторых определяется в
зависимости от <strong>типа файла-контейнера</strong> и
индекса:

<ul>
  <li><a href="Main_CFG_Old.html">Главная конфигурация проекта
    (старый формат)</a>;</li>
  <li><a href="User_CFG_Old.html">Пользовательская конфигурация
    (старый формат)</a>;</li>
  <li><a href="Objects_File_Old.html">Старый файл тематических
    слоёв графических объектов карты.</a></li>
</ul>

<p>Работа со старым форматом файла - контейнера
через некий стандартный API не предусмотрена.</p>

<h2><a name="Container">1. Структура файла - контейнера.</a></h2>

<p>В общем случае файла состоит из трёх основных
частей:</p>

<table>
  <tr>
    <th>Адрес в файле</th>
    <th>Название блока</th>
  </tr>
  <tr>
    <td class="RefAdres">00h - 1Fh</td>
    <td class="Refer">Заголовок</td>
  </tr>
  <tr>
    <td class="RefAdres">20h - 7FFh</td>
    <td class="Refer">Индексы</td>
  </tr>
  <tr>
    <td class="RefAdres">800h - до конца файла</td>
    <td class="Refer">Блоки</td>
  </tr>
</table>

<p>Но для каждого типа контейнера они разные.</p>

<h3><a name="Container_Head">1.1. Структура заголовка</a></h3>

<p>Структура заголовка контейнера старого
формата не определяет внутреннюю структуру
файла. Содержание файла определяется по его
расширению</p>

<p>Так, например, у пользовательской конфигурации
старого формата из заголовка присутствуют
только первые два поля, а для главной
конфигурации проекта отсутствует версия
конфигурационного файла.</p>

<table>
  <tr>
    <th>Начало</th>
    <th>Размер</th>
    <th>Параметр</th>
    <th>.mpx</th>
    <th>.cfg</th>
    <th>.cfm</th>
  </tr>
  <tr>
    <td class="RefAdres">00h</td>
    <td>4(dword)</td>
    <td class="Refer">Адрес последнего блока</td>
    <td>есть</td>
    <td>есть</td>
    <td>есть</td>
  </tr>
  <tr>
    <td class="RefAdres">04h</td>
    <td>4(dword)</td>
    <td class="Refer">Размер файла - контейнера</td>
    <td>есть</td>
    <td>есть</td>
    <td>есть</td>
  </tr>
  <tr>
    <td class="RefAdres">08h </td>
    <td>2(short)</td>
    <td class="Refer">Версия файла - контейнера</td>
    <td>есть</td>
    <td>нет</td>
    <td>нет</td>
  </tr>
  <tr>
    <td class="RefAdres">08h</td>
    <td>24(char)</td>
    <td class="Refer">Название файла - контейнера</td>
    <td>есть</td>
    <td>есть</td>
    <td>нет</td>
  </tr>
</table>

<p><span class="Refer">Адрес последнего блока</span> -
содержит адрес последнего блока в файле.</p>

<p><span class="Refer">Размер файла - контейнера</span> -
определяет адрес для записи нового блока или
старого блока, размер которого стал больше его
старого месторасположения.</p>

<p><span class="Refer">Версия файла - контейнера</span> -
похоже, нигде не участвует. Создана недавно для
дальнейшего использования.</p>

<p><span class="Refer">Название файла - контейнера</span>
содержит короткое описание данного файла.
Предназначено оно для визуального определения
назначения данного файла. </p>

<p>В зависимости от <span class="Refer">типа файла</span>
различают следующие типы контейнера:</p>

<table>
  <tr>
    <th>расш.</th>
    <th>Название контейнера</th>
    <th>Описание</th>
  </tr>
  <tr>
    <td>.cfp</td>
    <td>ГЛОБАЛЬНАЯ НАСТРОЙКА</td>
    <td>Настройки предприятия [L_GLOBAL.CFP]</td>
  </tr>
  <tr>
    <td>.cfg</td>
    <td>НАСТРОЙКА КАРТО-ПРОЕКТА</td>
    <td><a href="Main_CFG.html">Главная конфигурация проекта;</a> </td>
  </tr>
  <tr>
    <td>.cfm</td>
    <td></td>
    <td><a href="User_CFG.html">Пользовательская конфигурация;</a>
    </td>
  </tr>
  <tr>
    <td>.mpx</td>
    <td>ГРАФИЧЕСКИЕ ДАННЫЕ</td>
    <td><a href="Objects_File.html">Тематический слой графических
    объектов карты.</a> </td>
  </tr>
</table>

<h3><a name="Container_Index">1.2. Индексы</a></h3>

<p>Индексы представляют собой массив адресов
главных блоков внутри контейнера (<strong>“dword”</strong> или <strong>4
байта</strong> на один индекс). Для файла графических
объектов индекс имеет более сложную структуру.</p>

<p>Располагаются индексы в области от конца
заголовка (адрес <span class="RefAdres">20h</span>) до начала
блоков (адрес <span class="RefAdres">800h</span> {<span class="RefAdres">1000h</span>
для файла графических объектов}).</p>

<p>Всего зарезервировано <strong>504</strong> индекса (а значит и
главных блоков).</p>

<h3><a name="Container_Blocks">1.3. Блоки</a></h3>

<p>Блоки располагаются в области от адреса <span
class="RefAdres">800h</span> (<span class="RefAdres">1000h</span> для файла
графических объектов) до конца файла. Номер
индекса строго привязан к тематике конкретного
блока для данного <strong>типа файла</strong>. </p>

<h3>1.3. Обязательный заголовок блоков</h3>

<p>В общем случае заголовок выглядит в таком виде:</p>

<table>
  <tr>
    <th>позиция </th>
    <th>Размер</th>
    <th>Имя </th>
    <th>Описание </th>
  </tr>
  <tr>
    <td class="RefAdres">00h</td>
    <td>2(word)</td>
    <td><strong>len_bloc</strong></td>
    <td>размер блока ( свой размер )</td>
  </tr>
  <tr>
    <td class="RefAdres">02h</td>
    <td>2(word)</td>
    <td><strong>len_bloc_max</strong></td>
    <td>максимальный размер блока</td>
  </tr>
  <tr>
    <td class="RefAdres">04h</td>
    <td COLSPAN="3" ALIGN="center">Тело блока</td>
  </tr>
</table>

<p>Но для каждого типа контейнера они разные.</p>

<h3>1.4. Работа с блоками контейнера</h3>

<p>При работе с файлом программа или читает тело
блока или записывает его. При этом знание о
внутренней структуре блока целиком возлагаются
на программиста. Автоматизируется только
процесс размещения блока в файле.</p>

<p class="Remark">Чтение блока:</p>

<p class="Notice">При чтении блока - ничего интересного
не происходит. Программа читает индекс (адрес
блока в файле) и по этому адресу читает тело
блока, затем происходит его разбор.</p>

<p class="Remark">Запись блока:</p>

<p class="Notice">При записи блока - программа сначала
упаковывает данные в единый блок, получается <span
class="Refer">тело блока</span> и вычисляется <strong>размер</strong>
блока. Затем программа получает адрес блока в
индексах и читает <span class="Refer">обязательный
заголовок</span>. </p>

<p class="Notice">&nbsp;</p>

<p class="Notice">Если <span class="Refer">максимальный размер
блока</span> <strong><u>больше</u></strong>, чем размер
записываемого блока или блок является последним
(для этого контролируется <span class="Refer">Адрес
последнего блока</span>), то <span class="Refer">блок </span>записывается
на место старого&nbsp; блока. В случае если блок
последний, то изменяется и <span class="Refer">максимальный
размер блока.</span> При этом изменяются значения:</p>

<p class="Notice"><span class="Refer">размер блока</span>;</p>

<p class="Notice"><span class="Refer">максимальный размер блока </span>(если
блок последний);</p>

<p class="Notice"><span class="Refer">Заголовок.Размер файла
конфигурации </span>(если блок последний);</p>

<p class="Notice">&nbsp;</p>

<p class="Notice">Если <span class="Refer">максимальный размер
блока</span> <strong><u>меньше</u></strong>, но блок не
является последним или блок ещё не был записан,
то программа записывает блок в конец файла. При
этом изменяются значения:</p>

<p class="Notice"><span class="Refer">В индексах - адрес блока</span>;</p>

<p class="Notice"><span class="Refer">Блок.размер блока</span>;</p>

<p class="Notice"><span class="Refer">Блок.максимальный размер
блока </span>(если блок последний);</p>

<p class="Notice"><span class="Refer">Заголовок.Адрес последнего
блока</span>;</p>

<p class="Notice"><span class="Refer">Заголовок.Размер файла
конфигурации</span>;</p>
