<h1>Внутренний формат файла - контейнера.</h1>

<p>Некоторые файлы программного комплекса <strong>LasGIS</strong>
представлены в виде файла - контейнера (в
дальнейшем <strong>контейнер</strong>), который
представляет собой набор индексированных
блоков.</p>

<p>Содержание каждого блока определяется в
зависимости от <strong>типа файла-контейнера:</strong>

<ol>
  <li><a href="Global_CFG.html">Главная конфигурация предприятия</a>;</li>
  <li><a href="Main_CFG.html">Главная конфигурация проекта</a>;</li>
  <li><a href="User_CFG.html">Пользовательская конфигурация</a>;</li>
  <li><a href="Objects_File.html">Тематический слой графических
    объектов карты</a>.</li>
</ol>

<p>Кроме того, структура контейнера может
меняться в зависимости от <a href="#Container_Head_Version"><span
class="Refer">Версии контейнера</span></a> и <a
href="#Container_Head_Type"><span class="Refer">Версия реализации</span></a>,
которые определяются в заголовке контейнера&nbsp;
(см. дальше).</p>

<p>Для работы с&nbsp; контейнером применяется
стандартный API, который заключён в библиотеке <span
class="Refer">LG_container.lib</span> (см. описание <a
href="API_Container.html#API_Container">API доступа к контейнеру</a>).
При этом библиотека должна поддерживать работу
со всеми предыдущими версиями типа файла -
контейнера.</p>

<p class="Remark">Примечание:</p>

<p class="Notice">В настоящее время действует старый
формат файла - контейнера (см. <a href="Container_Old.html">Старый
формат файла - контейнера</a>).</p>

<h2><a name="Container">1. Структура файла - контейнера.</a></h2>

<p>Структура файла состоит из трёх основных
частей:</p>

<table>
  <tr>
    <th>Адрес в файле</th>
    <th>Название блока</th>
  </tr>
  <tr>
    <td class="RefAdres">00h - 1Fh</td>
    <td class="Refer"><a href="#Container_Head">Заголовок</a></td>
  </tr>
  <tr>
    <td class="RefAdres">40h - до конца файла</td>
    <td class="Refer"><a href="#Container_Blocks">Блоки</a></td>
  </tr>
</table>

<h3><a name="Container_Head">1.1. Структура заголовка:</a></h3>

<p>Структура заголовка неизменна для всех типов и
версий контейнеров и полностью определяет
внутреннюю структуру файла. Старый файл -
контейнер <a href="Container_Old.html#Container_Head">содержит
другой формат заголовка</a>.</p>

<table>
  <tr>
    <th><strong>Начало</strong> </th>
    <th><strong>Размер</strong> </th>
    <th><strong>Параметр</strong> </th>
  </tr>
  <tr>
    <td class="RefAdres"><p class="RefAdres">00h </td>
    <td>4(char)</td>
    <td class="Refer">Тип контейнера</td>
  </tr>
  <tr>
    <td class="RefAdres"><p class="RefAdres">04h</td>
    <td>2(short)</td>
    <td class="Refer">Версия контейнера</td>
  </tr>
  <tr>
    <td class="RefAdres">06h </td>
    <td>2(short)</td>
    <td class="Refer">Версия реализации</td>
  </tr>
  <tr>
    <td class="RefAdres">08h </td>
    <td>4(dword)</td>
    <td class="Refer">Адрес главного блока</td>
  </tr>
  <tr>
    <td class="RefAdres">0Ch </td>
    <td>4(dword)</td>
    <td class="Refer">--- резерв ---</td>
  </tr>
  <tr>
    <td class="RefAdres">10h</td>
    <td>48(char)</td>
    <td class="Refer">Название файла - контейнера</td>
  </tr>
</table>

<p><span class="Refer"><a name="Container_Head_Mnemo">Тип контейнера</a></span>
содержит мнемоническое обозначение типа файла. </p>

<p><a name="Container_Head_Version"><span class="Refer">Версия контейнера</span></a>
определяет структуру файла - контейнера и
обязательного заголовка блока, и не касается
внутренней организации блока. Значение версии
контейнера необходимо для работы библиотеки <a
href="API_Container.html#API_Container">API доступа к контейнеру</a>.</p>

<p><span class="Refer"><a name="Container_Head_Type">Версия реализации</a></span>
определяет рабочее наполнение блоков, которое
должен отслеживать разработчик программного
обеспечения.</p>

<p><span class="Refer"><a name="Container_Head_Address">Адрес главного
блока</a></span> определяет адрес главного блока
внутри файла-контейнера. Все блоки в контейнере
равнозначны, поэтому данный адрес может быть
любым, в пределах от <span class="RefAdres">40h</span> до конца
файла. Если этот адрес равен <span class="RefAdres">00h</span>
или меньше<span class="RefAdres"> 40h</span>, то значит главный
блок в контейнере отсутствует.</p>

<p><a name="Container_Head_Describe"><span class="Refer">Название файла -
контейнера</span></a> содержит короткое описание
данного файла. Предназначено оно для визуального
определения назначения данного файла. </p>

<p>В зависимости от <span class="Refer">типа файла</span>
различают следующие типы контейнера:</p>

<table>
  <tr>
    <th>расширение файла</th>
    <th>тип контейнера</th>
    <th>Название контейнера</th>
    <th>Описание</th>
  </tr>
  <tr>
    <td>*.cfp</td>
    <td>LGCG</td>
    <td>ГЛОБАЛЬНАЯ КОНФИГУРАЦИЯ\0</td>
    <td><a href="Global_CFG.html">Главная конфигурация
    предприятия</a> </td>
  </tr>
  <tr>
    <td>*.cfg</td>
    <td>LGCL</td>
    <td>ОПИСАНИЕ ПРОЕКТА LasGIS\0</td>
    <td><a href="Main_CFG.html">Главная конфигурация проекта</a></td>
  </tr>
  <tr>
    <td>*.cfm</td>
    <td>LGCU</td>
    <td>НАСТРОЙКИ ПОЛЬЗОВАТЕЛЯ\0</td>
    <td><a href="User_CFG.html">Пользовательская конфигурация</a></td>
  </tr>
  <tr>
    <td>*.mp?</td>
    <td>LGL?</td>
    <td>ГРАФИЧЕСКИЙ СЛОЙ LasGIS\0</td>
    <td><a href="Objects_File.html">Тематический слой графических
    объектов карты</a></td>
  </tr>
</table>

<p>Здесь ворпрос в тематических слоях связан с
различными типами тематических слоёв (<span class="Refer">'P'</span>
- точка, <span class="Refer">'L'</span> - линия,&nbsp; <span class="Refer">'A'</span>
- плоскость,&nbsp; <span class="Refer">'S'</span> - полоса,&nbsp; <span
class="Refer">'T'</span> - текст,&nbsp; <span class="Refer">'F'</span> -
поверхность и т.д.).</p>

<h3><a name="Container_Index">1.2. Индексы</a></h3>

<p>В новой версии файла-контейнера, индексов, как
таковых, нет. Вместо этого введено понятие
главного блока, в котором обязан быть массив
индексов.</p>

<p>Адрес главного блока указывается в заголовке
файла-контейнера.</p>

<p>Массив индексов главного блока, как и всех
других блоков, представляет собой массив адресов
блоков первого уровня внутри контейнера (<strong>“dword”</strong>
или <strong>4 байта</strong> на один индекс). </p>

<p>Кроме этого массив индексов может
располагаться внутри каждого блока N-нного
уровня. В этом случае можно говорить о
вложенности подблоков.</p>

<h3><a name="Container_Blocks">1.3. Блоки</a></h3>

<p>Блоки располагаются в области от адреса <span
class="RefAdres">40h</span> до конца файла. Номер индекса
строго привязан к тематике конкретного блока для
данного <strong>типа файла</strong>. </p>

<h4><strong>1.3.1. Структура обязательного заголовка блока</strong></h4>

<table>
  <tr>
    <th>Начало </th>
    <th>Размер </th>
    <th>Параметр </th>
  </tr>
  <tr>
    <td class="RefAdres">00h</td>
    <td>4(dword)</td>
    <td><span class="Refer">Размер блока</span> [<strong>SizeB</strong>]</td>
  </tr>
  <tr>
    <td class="RefAdres">04h </td>
    <td>4(dword)</td>
    <td class="Refer">Максимальный размер блока</td>
  </tr>
  <tr>
    <td class="RefAdres">08h </td>
    <td>2(word)</td>
    <td><span class="Refer">Число подиндексов</span> [<strong>NInd</strong>]</td>
  </tr>
  <tr>
    <td class="RefAdres">0Ah</td>
    <td>2(word)</td>
    <td class="Refer">Версия блока</td>
  </tr>
  <tr>
    <td class="RefAdres">0Ch</td>
    <td>4(dword)</td>
    <td class="Refer">Старый адрес блока</td>
  </tr>
  <tr>
    <td class="RefAdres">10h</td>
    <td><strong>NInd</strong>*4(dword[<strong>NInd</strong>])</td>
    <td class="Refer">Массив индексов подблоков</td>
  </tr>
  <tr>
    <td class="RefAdres">10h+NInd*4</td>
    <td><strong>SizeB</strong>(byte[<strong>SizeB</strong>])</td>
    <td class="Refer">Тело блока</td>
  </tr>
</table>

<p>Параметр <span class="Refer">“размер блока”</span>
определяет действительный размер блока, включая
заголовок блока массив индексов и тело блока.</p>

<p>Параметр <span class="Refer">“максимальный размер
блока” </span>задает размер пространства, в
пределах которого блок может изменять свои
размеры, не изменяя своего адреса.</p>

<p>Если параметр <span class="Refer">“число подиндексов”</span>
не равен нулю, следовательно этот блок содержит в
себе массив индексов подблоков, который
размещается после заголовка и перед телом блока.</p>

<p><span class="Refer">&quot;Версия блока</span>&quot; определяет
текущую внутреннюю структуру блока, которую
должен отслеживать разработчик программного
обеспечения. При изменении структуры блока
(изменяется размер и наличие полей, но не
значений полей), <em>версия блока</em> должна
меняться.</p>

<p>Параметр <span class="Refer">“Старый адрес блока” </span>содержит
старый адрес блока после перемещения его в
другое место. Изначально параметр принимает
нулевое значение.</p>

<p><span class="Refer">Массив индексов</span> представляет
собой массив <u>абсолютных</u> адресов подблоков
данного блока (<strong>“dword”</strong> или <strong>4 байта</strong> на
один адрес). Так как при перемещении блока
подблоки не перемещаются, значит блоки не должны
теряться.</p>

<p>Если какой либо индекс равен <span class="RefAdres">00h</span>
или меньше<span class="RefAdres"> 40h</span>, то это значит, что
данного подблока не существует.</p>

<p><span class="Refer">Тело блока</span> полностью
определяется программистом. Размер тела блока
вычисляется по формуле: </p>

<p class="Prog">&lt;Размер тела&gt; = &lt;Размер блока&gt; -
&lt;Размер заголовка&gt; - &lt;Число подиндексов&gt;*4 ;</p>

<p>Адрес тела блока определяется по формуле: </p>

<p class="Prog">&lt;Адрес тела&gt; = &lt;Адрес блока&gt; +
&lt;Размер заголовка&gt; + &lt;Число подиндексов&gt;*4;</p>

<h3>1.4. Работа с блоками контейнера</h3>

<p>При работе с блоками программа или читает тело
блока или записывает его. При этом знание о
внутренней структуре блока целиком возлагаются
на программиста. В <a href="API_Container.html#API_Container">API
доступа к контейнеру</a> автоматизируется только
процесс размещения блока в файле.</p>

<p class="Remark">Чтение блока:</p>

<p class="Notice">При чтении блока - ничего интересного
не происходит. Программа читает индекс (адрес
блока в файле) и по этому адресу читает сначала
заголовок блока, после чего тело блока, а затем
происходит его разбор в пользовательской
программе.</p>

<p class="Remark">Запись блока:</p>

<p class="Notice">При записи блока - программа сначала
упаковывает данные в единый блок, получается <span
class="Refer">тело блока</span> и вычисляется <strong>размер</strong>
блока. Затем программа получает адрес блока в
индексах и читает <span class="Refer">обязательный
заголовок</span>. </p>

<p class="Notice">&nbsp;</p>

<p class="Notice">Если <span class="Refer">максимальный размер
блока</span> <strong><u>больше</u></strong>, чем размер
записываемого блока, то <span class="Refer">блок </span>записывается
на место старого&nbsp; блока. При этом изменяются
следующие значения:</p>

<p class="Notice"><span class="Refer">Блок.&lt;размер блока&gt;</span>;</p>

<p class="Notice">&nbsp;</p>

<p class="Notice">Если <span class="Refer">максимальный размер
блока</span> <strong><u>меньше</u></strong>, чем размер
записываемого блока или блок ещё не был записан (<span
class="Refer">&lt;индекс</span>&gt; == NULL), то программа
записывает блок в конец файла. При этом
изменяются следующие значения:</p>

<p class="Notice"><span class="Refer">&lt;индекс&gt;</span>;</p>

<p class="Notice"><span class="Refer">Блок.&lt;размер блока&gt;</span>;</p>

<p class="Notice"><span class="Refer">Блок.&lt;максимальный размер
блока&gt;</span> устанавливается на N байт больше
размера блока;</p>

<p class="Notice"><span class="Refer">Блок.&lt;Старый адрес блока&gt;</span>
должно указывать на старый блок (то значение,
которое было в поле <span class="Refer">&lt;индекс&gt;</span>).</p>

<p class="Remark">Особенности записи:</p>

<p class="Notice">При записи блока необходимо заполнять
всё пространство, включая пустое пространство от
конца блока<span class="Refer"> &lt;размер блока&gt;</span> до
конца выделенного пространства для записи блока <span
class="Refer">&lt;максимальный размер блока&gt;</span>. Иначе
при записи в конец файла пустое пространство
последнего&nbsp; блока потеряется.</p>

<p>&nbsp;</p>

<h3>1.5. Работа с блокировками</h3>

<p>При работе в сети необходимы блокировки во
избежание коллизий, связанных с одновременным
редактированием частей файла-контейнера разными
пользователями.</p>

<p><u>Минимальной единицей блокирования является
отдельный блок.</u> Реально блокируется индекс в родительском блоке, указывающий на этот блок.</p>
<p class="Remark">Существуют следующие коллизии, которые могут возникнуть в результате блокирования / редактирования блока:</p>
<ul type="square">
  <li>Другой пользователь заблокировал <strong>данный блок</strong></li>
  <li>Другой пользователь заблокировал <strong>данный блок</li>
</ul>
<p>Так как система ориентирована на работу в
сетьи, то при редактировании </p>
