<h3>Что такое HTML</h3>
<p>Изначально HTML задумывался как формат документов с сохранением
разметки. Потом, к нему добавили динамичность через возможность
программно
изменять атрибуты. Однако если забыть про эту возможнось - HTML так и
остался <strong>документом с разметкой</strong>.</p>
<h4><a name="HTML_consist_from_tegs"></a>1. HTML состоит из <strong>тегов</strong></h4>
<p>Тег это такая штука, которая начинается конструкции <span
 class="Refer">&lt;название&gt;</span> и кончается конструкцией c
тем-же
названием, но с косынкой впереди названия тега <span class="Refer">&lt;/название&gt;</span>.
</p>
<p>Есть укороченный тип тега. В этом случае косынка располагается в
конце первой конструкции, а замыкающей конструкции вовсе нет - <span
 class="Refer">&lt;название_тега название_атрибута="описание
атрибута"/&gt;</span>.
Укороченный тип обычно применяется с атрибутами.
</p>
<p>Тег может содержать некоторые аттрибуты. В этом случае в первую
конструкцию добавляют описание одного или нескольких атрибутов -
<span class="Refer">название_атрибута="описание атрибута"</span>:
</p>
<p class="Prog"><strong>&lt;тег1</strong>
  attrib1="значение первого атрибута"
  attrib2="значение второго атрибута"
<strong>&gt;</strong>
  Здесь располагается тело тега, которое может кроме текста
  содержать и внутренние теги. Например:
  <strong>&lt;тег2</strong> attrib="значение атрибута" <strong>&gt;&lt;/тег2&gt;</strong>
  <strong>&lt;тег2</strong> attrib="значение атрибута" <strong>/&gt;</strong>
  Последний тег является укороченным.
<strong>&lt;/тег1&gt;</strong>
</p>
<h5><a name="SPACE_and_other"></a>1.1. Пробелы и специальные символы</h5>
<p>Лишние пробелы и переводы строк игнорируются. Это означает, что
сколько бы
ни поставить пробелов в исходном документе, "броузер" поставит только
один пробел. Преводы строк будут располагаться в зависимости от
размеров окна и правил форматирования абзаца. </p>
<p>Для принудительной вставки пробела применяют специальный символ <span
 class="Refer">&amp;nbsp;</span> Все специальные символы начинаются с
амперсанта - <span class="Refer">&amp;</span>
и кончаются точкой с запятой - <span class="Refer">;</span></p>
<p>Вот далеко не полный список специальных символов:</p>
<table border="1">
  <tbody>
    <tr>
      <th>в исходнике</th>
      <th>в броузере</th>
      <th>описание</th>
    </tr>
    <tr>
      <td>&amp;nbsp;</td>
      <td>[&nbsp;]</td>
      <td>неразделимый пробел</td>
    </tr>
    <tr>
      <td>&amp;lt;</td>
      <td>&lt;</td>
      <td>знак меньше</td>
    </tr>
    <tr>
      <td>&amp;gt;</td>
      <td>&gt;</td>
      <td>знак больше</td>
    </tr>
    <tr>
      <td>&amp;amp;</td>
      <td>&amp;</td>
      <td>амперсант</td>
    </tr>
  </tbody>
</table>
<h4><a name="Minimum_collection"></a>2. Минимальный набор для создания
странички</h4>
<p>Описание полного набора тегов можно найти в <a target="_blank"
 href="http://www.w3.org/TR/html4/">HTML 4.01 Specification (W3C)</a>.</p>
Здесь будут только теги, необходимые для создания документа.
<h5><a name="Paragraph"></a>2.1. &lt;P&gt; Абзац</h5>
<p>Абзац является основным способом формирования HTML документа.
Может применяться с разными стилями. <span class="HiRefer">Категорически
не рекомендуется</span> использовать прямое (помимо стиля)
форматирование абзаца.</p>
<p class="Prog">&lt;P class="Prog"&gt;Основной текст.&lt;/P&gt;</p>
<h6>2.1.1 Допустимое форматирование шрифта.</h6>
<p>Иногда нужно выделить или подчеркнуть отдельные слова или
словосочетания.
В этом случае применяется теги форматирования шрифта:</p>
<table border="1">
  <tbody>
    <tr>
      <th>в исходнике</th>
      <th>в броузере</th>
    </tr>
    <tr>
      <td>&lt;b&gt;толстый&lt;/b&gt; шрифт</td>
      <td><strong>толстый</strong> шрифт</td>
    </tr>
    <tr>
      <td>шрифт c &lt;i&gt;наклоном&lt;/i&gt;</td>
      <td>шрифт c <em>наклоном</em></td>
    </tr>
    <tr>
      <td>шрифт c &lt;u&gt;подчёркиванием&lt;/u&gt;</td>
      <td>шрифт c <u>подчёркиванием</u></td>
    </tr>
    <tr>
      <td>шрифт c &lt;b&gt;&lt;i&gt;&lt;u&gt;тем и другим
одновременно&lt;/u&gt;&lt;/i&gt;&lt;/b&gt;</td>
      <td>шрифт c <strong><em><u>тем и другим одновременно</u></em></strong></td>
    </tr>
  </tbody>
</table>
<h5><a name="Heading"></a>2.2. &lt;H1&gt; - &lt;H6&gt; Заголовок</h5>
<p>Заголовки разных уровней. Использование стилей возможно, но в данном
случае
<span class="HiRefer">не имеет смысла</span>!</p>
<p>&lt;H1&gt; - имеет наивысший уровень, а &lt;H6&gt; - соответственно
наинизший.</p>
<table border="1">
  <tbody>
    <tr>
      <th>в исходнике</th>
      <th>в броузере</th>
    </tr>
    <tr>
      <td>
      <p class="Prog">&lt;h1&gt;Заголовок 1&lt;/h1&gt;</p>
      </td>
      <td>
      <h1>Заголовок 1</h1>
      </td>
    </tr>
    <tr>
      <td>
      <p class="Prog">&lt;h2&gt;Заголовок 1&lt;/h2&gt;</p>
      </td>
      <td>
      <h2>Заголовок 2</h2>
      </td>
    </tr>
    <tr>
      <td>
      <p class="Prog">&lt;h3&gt;Заголовок 1&lt;/h3&gt;</p>
      </td>
      <td>
      <h3>Заголовок 3</h3>
      </td>
    </tr>
    <tr>
      <td>
      <p class="Prog">&lt;h4&gt;Заголовок 1&lt;/h4&gt;</p>
      </td>
      <td>
      <h4>Заголовок 4</h4>
      </td>
    </tr>
    <tr>
      <td>
      <p class="Prog">&lt;h5&gt;Заголовок 1&lt;/h5&gt;</p>
      </td>
      <td>
      <h5>Заголовок 5</h5>
      </td>
    </tr>
    <tr>
      <td>
      <p class="Prog">&lt;h6&gt;Заголовок 1&lt;/h6&gt;</p>
      </td>
      <td>
      <h6>Заголовок 6</h6>
      </td>
    </tr>
  </tbody>
</table>
<h5><a name="Reference"></a>2.3. &lt;A&gt; Ссылка</h5>
<p>Ссылка используется для перехода на другой документ HTML.
Для задания условий перехода используются аттрибуты тега:</p>
<table class="Prog" border="1">
  <tbody>
    <tr>
      <th>имя атрибута</th>
      <th>&nbsp;</th>
      <th>пример значения</th>
      <th>описание</th>
    </tr>
    <tr>
      <td>href</td>
      <td>=</td>
      <td>Explanation.html#mark</td>
      <td>Ссылка на тот документ, на который будет переход после клика.
Можно после знака <span class="Refer">#</span> указать метку, к
которой перейдёт браузер. Кроме того, в качестве ссылки может быть
вызов функции JavaScript. </td>
    </tr>
    <tr>
      <td>target</td>
      <td>=</td>
      <td>target_doc</td>
      <td>Объект типа frame в котором будет показываться выбранный
документ.</td>
    </tr>
    <tr>
      <td>name</td>
      <td>=</td>
      <td>mark </td>
      <td>Используется для обозначения метки, к которой перейдёт
браузер</td>
    </tr>
  </tbody>
</table>
<p>Всё что находится внутри тела тега (от <span class="Refer">&gt;</span>
до <span class="Refer">&lt;/a&gt;</span>) будет являться ссылочной
строкой. Таким образом ссылкой может быть текст, картинка, текст +
картинка и т.д.</p>
<p>Для указания на конкретное место в страничке необходимо сделать
метку в данной страничке, после чего можно на эту метку указывать.</p>
<h6>2.3.1. Создание метки</h6>
<p>Для создания метки надо заполнить только атрибут <span class="Refer">name</span>:</p>
<p class="Prog">&lt;a <strong>name</strong>="mark"&gt;Метка внутри документа Explanation.html&lt;/a&gt;</p>
<a name="mark">Метка внутри документа Explanation.html</a>
<h6>2.3.2. Создание ссылки внутри документа</h6>
<p>Для создания ссылки на метку внутри одного документа в атрибуте <span
 class="Refer">href</span> пишем только метку:</p>
<p class="Prog">&lt;a <strong>href="#mark"</strong>&gt;Ссылка на метку внутри документа&lt;/a&gt;</p>
<a href="#mark">Ссылка на метку внутри документа</a>
<h6>2.3.3. Создание ссылки из другого документа</h6>
<p>Для создания ссылки на метку из другого документа необходимо указать
сам
документ:</p>
<p class="Prog">&lt;a href="<strong>Explanation.html</strong>#mark"&gt;Ссылка на документ Explanation.html + метка&lt;/a&gt;</p>
<a href="/explanation/explanation.html#mark">Ссылка на документ Explanation.html +
метка</a>
<h6>2.3.4. Добавляем цель (target)</h6>
<p>Добавляем цель для документа (объект типа frame, в котором должна
отобразиться страничка):</p>
<p class="Prog">&lt;a href="Explanation.html#mark" <strong>target="target_menu"</strong>&gt;Ссылка на документ
с выводом в target_menu&lt;/a&gt;</p>
<a href="/explanation/explanation.html#mark" target="target_menu">Ссылка на документ
с выводом в target_menu</a>
<h6>2.3.5. Создаём ссылку через вызов функции</h6>
<p>Для вызова через функцию надо предварительно функцию создать.
В нашем случае функция находится в файле web/images/menu.js и
называется
<span class="Refer">LoadUrl()</span>.</p>
<p>Первый параметр содержит <span class="Refer">ссылку на документ</span>,
который затем поместит в окно документа (target="target_doc").</p>
<p>Второй параметр содержит <span class="Refer">ссылку на меню</span>.
Меню это то-же HTML документ. Функция <span class="Refer">LoadUrl()</span>
поместит это меню в левое маленькое окно, где по определению должно
быть
меню.</p>
<p>Третий параметр содержит <span class="Refer">строку заголовка</span>.
В момент выполнения функции эта строка помещается в заголовок всей
страницы.</p>
<p>Главное помнить, что эта функция должна работать только в меню и
главном
окне (index.html). <span class="HiRefer">В документ её <u>нельзя</u>
помещать</span>:</p>
<p class="Prog">&lt;a href='javascript:LoadUrl(
  "Explanation.html#mark",
  "ExplanationMenu.html",
  "Перешли по ссылке через вызов функции"
)'&gt;Ссылка через вызов функции&lt;/a&gt;</p>
<a
 href='javascript:LoadUrl("Explanation.html#mark", "ExplanationMenu.html",
  "Перешли по ссылке через вызов функции")'>
Ссылка через вызов функции</a>
<h5><a name="Image"></a>2.4. &lt;img&gt; картинка</h5>
<p>Предварительно картинку надо нарисовать в одном из удобоваримых
форматов. Здесь её можно только показать. Тег &lt;img&gt; является
укороченным, поэтому он содержит только первую конструкцию (без
&lt;/img&gt;)</p>
<p>Картинку можно ужать или растянуть. Для этого используют атрибуты
высота - height и ширина - width. Размерные атрибуты могут указываться
либо в пикселах ('10px' - 10 пикселов), либо в процентах от размера
экрана
('10%' - 10 процентов) при этом, почему-то, имеется в виду только <span
 class="Refer">ширина</span> клинтской части отображаемого окна.
Как для ширины, так и для высоты картинки.</p>
<h6>2.4.1. Просто картинка</h6>
<p>Выводим простую картинку:</p>
<p class="Prog">&lt;img src="images/TradeMark.jpg" height='64px' width='64px' /&gt;</p>
<img src="/images/TradeMark.jpg" height="64" width="64">
<h6>2.4.2. Картинка как ссылка</h6>
Кроме этого картинка может быть ссылкой. Для этого её надо обрамить
тегом
&lt;a&gt;. Однако, никто не мешает добавить текст после картинки.
<p class="Prog">&lt;a href="#mark"&gt;&lt;img src="images/TradeMark.jpg" /&gt;&lt;/a&gt;</p>
<a href="#mark"><img src="/images/TradeMark.jpg"></a>
<h6>2.4.3. Убираем бордюр</h6>
Если убрать бордюр, то какртинка - ссылка будет без рамки:
<p class="Prog">&lt;a href="#mark"&gt;&lt;img border='0' src="images/TradeMark.jpg" /&gt;&lt;/a&gt;</p>
<a href="#mark"><img src="/images/TradeMark.jpg" border="0"></a>
<h5><a name="Table"></a>2.5. &lt;table&gt; Таблица</h5>
<p>Таблица состоит из строк (тег &lt;tr&gt;) и значений столбца для
данной строки (тег &lt;td&gt;). Каждая таблица содержит набор строк, а
каждая строка - набор значений столбцов. Кроме того, существует тег
&lt;th&gt;, который применяетс как тег &lt;td&gt;, но означает заголовок.
Впрочем, тег &lt;th&gt; может располагаться в любом месте таблицы.</p>
<pre class="Prog">&lt;table border='1'&gt;
  &lt;tr&gt;<strong>&lt;th&gt;</strong>заголовок 1<strong>&lt;/th&gt;&lt;th&gt;</strong>заголовок 2<strong>&lt;/th&gt;&lt;th&gt;</strong>заголовок 3<strong>&lt;/th&gt;</strong>&lt;/tr&gt;
  &lt;tr&gt;&lt;td&gt;данные 11&lt;/td&gt;&lt;td&gt;данные 12&lt;/td&gt;&lt;td&gt;данные 13&lt;/td&gt;&lt;/tr&gt;
  &lt;tr&gt;&lt;td&gt;данные 21&lt;/td&gt;<strong>&lt;th&gt;</strong>данные 22<strong>&lt;/th&gt;</strong>&lt;td&gt;данные 23&lt;/td&gt;&lt;/tr&gt;
  &lt;tr&gt;&lt;td&gt;данные 31&lt;/td&gt;&lt;td&gt;данные 32&lt;/td&gt;&lt;td&gt;данные 33&lt;/td&gt;&lt;/tr&gt;
&lt;/table&gt;
</pre>
<table border='1'>
  <tr><th>заголовок 1</th><th>заголовок 2</th><th>заголовок 3</th></tr>
  <tr><td>данные 11</td><td>данные 12</td><td>данные 13</td></tr>
  <tr><td>данные 21</td><th>данные 22</th><td>данные 23</td></tr>
  <tr><td>данные 31</td><td>данные 32</td><td>данные 33</td></tr>
</table>
<h6>2.5.1. Совмещение столбцов и строк</h6>
<p>Для совмещения двух или более соседних столбцов в одной строке,
вместо этих столбцов рисуется один столбец (тег &lt;td&gt;), в котором
указан атрибут <span class="Refer">colspan='2'</span>.</p>
<p>Для совмещения двух или более соседних колонок в одну колонку,
необходимо в самом верхнем значений столбца (теги &lt;td&gt;)
указать атрибут <span class="Refer">rowspan='3'</span>, а остальные
значений столбца удалить. См. пример:</p>
<pre class="Prog">&lt;table border='1'&gt;
  &lt;tr&gt;&lt;th&gt;заголовок 1&lt;/th&gt;&lt;th <strong>colspan='2'</strong>&gt;заголовок 2, 3&lt;/th&gt;&lt;/tr&gt;
  &lt;tr&gt;&lt;td&gt;данные 11&lt;/td&gt;&lt;td&gt;данные 12&lt;/td&gt;&lt;td <strong>rowspan='3'</strong>&gt;данные 13, 23, 33&lt;/td&gt;&lt;/tr&gt;
  &lt;tr&gt;&lt;td <strong>rowspan='2'</strong>&gt;данные 21, 31&lt;/td&gt;&lt;th&gt;данные 22&lt;/th&gt;&lt;/tr&gt;
  &lt;tr&gt;&lt;td&gt;данные 32&lt;/td&gt;&lt;/tr&gt;
&lt;/table&gt;</pre>
<table border='1'>
  <tr><th>заголовок 1</th><th colspan='2'>заголовок 2, 3</th></tr>
  <tr><td>данные 11</td><td>данные 12</td><td rowspan='3'>данные 13, 23, 33</td></tr>
  <tr><td rowspan='2'>данные 21, 31</td><th>данные 22</th></tr>
  <tr><td>данные 32</td></tr>
</table>
<h6>2.5.2. Совмещение столбцов и строк</h6>
<p>Для совмещения двух или более соседних столбцов в одной строке,
вместо этих столбцов рисуется один столбец (тег &lt;td&gt;), в котором
указан атрибут <span class="Refer">colspan='2'</span>.</p>
<p><br>
<br>
<br>
<br>
<br>
</p>
<h1>!!!! TO BE CONTINUED !!!!</h1>