<html>

<head>
<meta HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=UTF-8">
<meta NAME="GENERATOR" CONTENT="Microsoft FrontPage 4.0">
<link rel="stylesheet" type="text/css" href="/css/default.css">
<title>Формат графического объекта</title>
</head>

<body>

<h1>Формат графического объекта</h1>

<p>Формат графического объекта, хранимого в базе
(на SQL сервере) отличается от формата
графического объекта, считанного и участвующего
в работе программы. Цель проектирования
структуры графического объекта хранимого и
работающего в том, чтобы:

<ol>
  <li>предусмотреть все возможные типы объектов
    карты и зафиксировать их свойства,</li>
  <li>уменьшить возможные преобразования объекта при
    конвертации его из одного типа в другой.</li>
</ol>

<p>Описание формата смотри в следующих пунктах:</p>

<p>
  1. <a HREF="MapO_1.html"><u>Структура графического объекта
  в программе</u></a></p>
<blockquote>

<p>
    1.1. <a href="MapO_Object.html"><u>Общий заголовок
    графического объекта</u></a><br>
    1.2. <a href="MapO_OPoint.html"><u>Тело графического объекта
    типа точка</u></a><br>
    1.3. <a href="MapO_OLine.html"><u>Тело  графического объекта
    типа линия</u></a><br>
    1.4. <a href="MapO_OStrip.html"><u>Тело графического объекта
    типа полоса</u></a><br>
    1.5. <a href="MapO_OAreal.html"><u>Тело графического объекта
    типа плоскость</u></a><br>
    1.6. <a href="MapO_OText.html"><u>Тело графического объекта
    типа надпись</u></a><br>
    1.7. <a href="MapO_eLine.html"><u>Формат элементарной линии</u></a><br>
    1.8. <a href="MapO_ePoint.html"><u>Структура точки объекта типа
    линия, полоса или плоскость</u></a></p>
</blockquote>

<p>
  2. <a href="MapO_2.html"><u>Формат графического объекта
  хранимого в базе</u></a></p>
<blockquote>
    <p>
    <u>2</u>.1. <a href="MapO_2_TableObjects.html"><u>Главная таблица
    графических объектов &lt;Objects&gt;</u></a><br>
    </p>
</blockquote>
</body>
</html>
